InformationRegisters/SM_СогласованиеДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>SM_СогласованиеДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗапуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СогласованиеЗавершено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущийСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SM_СтатусыСогласования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/SM_СтатусыСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>SM_СтатусыСогласования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВПроцессе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/SM_СогласованиеДокументов/Ext/ManagerModule.bsl
Процедура ДобавитьЗапись(Параметры) Экспорт
	Если СогласованиеЗапущенно(Параметры) Тогда
		Возврат;
	КонецЕсли;
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Параметры);
	МенеджерЗаписи.Записать();	
КонецПроцедуры 

Функция ПолучитьПараметры(ДокументСсылка = Неопределено) Экспорт
	Параметры = Новый Структура;
	Параметры.Вставить("Документ"				,ДокументСсылка);
	Параметры.Вставить("УникальныйИдентификатор",	);
	Параметры.Вставить("ДатаЗапуска"			,	);
	Параметры.Вставить("ДатаЗавершения"			,	);
	Параметры.Вставить("СогласованиеЗавершено"	,	);
	Параметры.Вставить("ТекущийСтатус"			,	); 
	Возврат Параметры;
КонецФункции

Процедура ЗаполнитьПараметрыПоУмолчанию(Параметры) Экспорт
	ЗначениеСвойства = "";
	Если Не Параметры.Свойство("Документ",ЗначениеСвойства) ИЛИ Не ЗначениеЗаполнено(ЗначениеСвойства) Тогда 
		Возврат;
	КонецЕсли;
	
	Параметры.УникальныйИдентификатор   = Строка(ЗначениеСвойства.УникальныйИдентификатор());
	Параметры.ДатаЗапуска               = ТекущаяДата();
	Параметры.ДатаЗавершения            = Дата(1,1,1);
	Параметры.СогласованиеЗавершено     = Ложь;
	Параметры.ТекущийСтатус             = Перечисления.SM_СтатусыСогласования.ВПроцессе;	
КонецПроцедуры  

Процедура ПолучитьТекущиеДанныеСогласования(Параметры) Экспорт
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Параметры,"Документ,УникальныйИдентификатор");
	МенеджерЗаписи.Прочитать();
	ЗаполнитьЗначенияСвойств(Параметры,МенеджерЗаписи);	
КонецПроцедуры   

Функция СогласованиеЗапущенно(Параметры) Экспорт
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Параметры);
	МенеджерЗаписи.Прочитать();
	Возврат МенеджерЗаписи.Выбран();
КонецФункции

Функция ПолучитьТекущееСогласование(Параметры) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	SM_СогласованиеДокументов.Документ КАК Документ,
	|	SM_СогласованиеДокументов.УникальныйИдентификатор КАК УникальныйИдентификатор,
	|	SM_СогласованиеДокументов.ДатаЗапуска КАК ДатаЗапуска,
	|	SM_СогласованиеДокументов.ДатаЗавершения КАК ДатаЗавершения,
	|	SM_СогласованиеДокументов.СогласованиеЗавершено КАК СогласованиеЗавершено,
	|	SM_СогласованиеДокументов.ТекущийСтатус КАК ТекущийСтатус
	|ИЗ
	|	РегистрСведений.SM_СогласованиеДокументов КАК SM_СогласованиеДокументов
	|ГДЕ
	|SM_СогласованиеДокументов.УникальныйИдентификатор = &УникальныйИдентификатор";
	
	Запрос.УстановитьПараметр("УникальныйИдентификатор", Параметры.УникальныйИдентификатор);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	ПараметрыТекущееСогласование = ПолучитьПараметры();
	Если РезультатЗапроса.Количество() = 0 Тогда
		Возврат ПараметрыТекущееСогласование;
	Иначе
		ТекущееСогласование = РезультатЗапроса[0];
		ЗаполнитьЗначенияСвойств(ПараметрыТекущееСогласование,ТекущееСогласование);
		
		Возврат ПараметрыТекущееСогласование;
	КонецЕсли;
КонецФункции

Процедура ИзменитьЗапись(Параметры) Экспорт
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Параметры);
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Параметры);
		МенеджерЗаписи.Записать();
	КонецЕсли;
КонецПроцедуры
